CREATE DATABASE  IF NOT EXISTS `hospital` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `hospital`;
-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: hospital
-- ------------------------------------------------------
-- Server version	8.2.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `clients`
--

DROP TABLE IF EXISTS `clients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clients` (
  `clientID` int NOT NULL AUTO_INCREMENT,
  `Surname` varchar(30) NOT NULL,
  `Name` varchar(30) NOT NULL,
  `Passport` char(11) NOT NULL,
  `OMS` char(16) NOT NULL,
  `Job` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`clientID`)
) ENGINE=InnoDB AUTO_INCREMENT=128 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clients`
--

LOCK TABLES `clients` WRITE;
/*!40000 ALTER TABLE `clients` DISABLE KEYS */;
INSERT INTO `clients` VALUES (1,'Снегирева','Наталия','4197 182682','9743421910552830','HR специалист'),(2,'Слобожанин','Михаил','4715 545465','1149293098216441','Патологоанатом'),(3,'Ямалетдинова','Милана','4650 531795','2776348453899287','Распиловщик'),(4,'Лобана','Настасья','4834 217593','1108465747598653','Преподаватель'),(5,'Тизенгаузен','Савва','4934 242797','1093092893808387','Вирусолог'),(6,'Зощенко','Настасья','4148 361953','3486998012506803','HR специалист'),(7,'Граббе','Тимофей','4353 999782','9365750795569666','Бизнес-аналитик'),(8,'Пшеничникова','Лана','4413 791709','9258830614474311','Кардиохирург'),(9,'Голубовская','Ева','4867 959215','7508752505935047','Штукатур'),(10,'Гайдуков','Серафим','4594 801116','1258825245577227','Декан'),(11,'Ярлыкова','Марина','4547 747936','9664000904779173','HR специалист'),(12,'Дубин','Герасим','4517 285712','2554863336702208','Инженер-гальваник'),(13,'Петров','Юрий','4537 234296','6721507738421125','Экспедитор на дальних поездках'),(14,'Жичкин','Афанасий','4031 526615','5805518699620375','Эпидемиолог'),(15,'Лихачёва','Галина','4246 249793','6150086064302530','Инженер-гальваник'),(16,'Тютчев','Иннокентий','4252 659413','2410114719663807','Трансфузиолог'),(17,'Царёв','Юрий','4451 416322','5014045309875758','Биоинженер'),(18,'Полкова','Марьямна','4886 886088','7017567148009769','Биоинженер'),(19,'Горностаев','Иван','4353 174673','9065189677135231','Скорняк'),(20,'Кутепов','Марк','4584 627106','9395768528708140','Кинолог'),(21,'Веденина','Евгения','4743 108894','4190916188008298','Столяр'),(22,'Яснова','Инна','4378 396642','7191956477122636','Воспитатель'),(23,'Ясевича','Марфа','4964 186301','1381157287349200','Судебный пристав'),(24,'Грешнев','Арсений','4545 913649','6067311485380606','Механик'),(25,'Черный','Никита','4084 725344','6571151443901478','Металлург'),(26,'Русакова','Пелагея','4466 199301','7027783993011815','Рефлексотерапевт'),(27,'Куликова','Лариса','4085 109911','8866290240845465','Оператор ПК'),(28,'Тетерин','Егор','4158 125321','7259503001363567','Кузнец'),(29,'Котик','Клара','4887 174542','3089217492365877','Нарколог'),(30,'Чукреев','Степан','4789 556261','8735527639677319','Астроном'),(31,'Дюгаева','Любовь','4920 489648','5574395969507291','Тестировщик'),(32,'Фаммуса','Клара','4038 522443','9673798861220116','Контролер банка'),(33,'Золин','Филипп','4468 893164','2337566457286187','Бактериолог'),(34,'Безрукова','Алена','4556 496708','1108839955530100','Проводник'),(35,'Кузинков','Иван','4763 587736','2111469377011247','Автослесарь'),(36,'Мартюшов','Артем','4835 373290','2494367800128223','Слесарь-механик'),(37,'Кизюрин','Иван','4634 839275','8452965356325390','Машинист локомотива'),(38,'Месяц','София','4545 579368','5004202898609244','Сексопатолог'),(39,'Куцак','Никита','4998 148976','4650440927151011','Кинолог'),(40,'Палагута','Игнат','4918 758044','1827661564759940','Нефролог'),(41,'Сагунов','Денис','4590 500163','1475722978037593','Бухгалтер'),(42,'Чиркова','Рада','4096 425233','3539019020184704','Слесарь-механик'),(43,'Лисицына','Юлия','4592 605272','3501387978763507','Ректор'),(44,'Мартюшова','Нина','4560 643724','9898432052663874','Воспитатель'),(45,'Арсеньев','Евгений','4835 207297','8624808558616563','Проводник'),(46,'Пахомов','Филипп','4028 985653','7823622376842275','Воспитатель'),(47,'Кропанина','Катерина','4161 337967','3573024016016131','Слесарь-механик'),(48,'Акулова','Виктория','4695 857360','2914841345440679','Инженер-технолог'),(49,'Яруллин','Вениамин','4596 173165','6793866240889793','Экономист-аналитик'),(50,'Бока','Ольга','4282 323489','6400213139750154','Оториноларинголог'),(51,'Житков','Николай','4788 409951','1628689492268810','Вирусолог'),(52,'Мигунова','Инна','4011 772821','6030850426861101','Юрист'),(53,'Черенчиков','Григорий','4225 578994','5910462843411183','Монтажник радиоэлектронной аппаратуры и приборов'),(54,'Цыринская','Алина','4117 726977','2854153632001395','Проректор'),(55,'Золотарев','Тимофей','4319 896862','9734717711710741','Маркетолог'),(56,'Сысоева','Арина','4129 704781','2260782079747899','Кредитный консультант'),(57,'Хребтова','Клара','4992 286639','8364971750035586','Эпидемиолог'),(58,'Панина','Дарья','4577 623195','3781022638044991','Тюремный надзиратель'),(59,'Вишневская','Таисия','4421 635553','5228306830690888','Архивариус'),(60,'Дудко','Игнат','4680 959580','4874664978721812','Орнитолог'),(61,'Ёжикова','Лариса','4463 414746','9787455906500679','Океанолог'),(62,'Невьянцева','Марианна','4726 511456','7020839421550153','Психолог'),(63,'Желдин','Геннадий','4690 700840','4998851457038872','Юрисконсульт'),(64,'Федотова','Евгения','4829 527377','2898043268843897','Бухгалтер'),(65,'Кубышкина','Светлана','4869 411053','4439073110867315','Водитель'),(66,'Яндульский','Михаил','4697 432501','9506653092030697','Слесарь-механик'),(67,'Трунин','Леонтий','4911 278863','8520414678966157','Тестировщик'),(68,'Ярустовский','Денис','4216 589077','3803281101585635','Коммерческий директор'),(69,'Тамахин','Игнат','4539 219858','2265880350752123','Воспитатель'),(70,'Терентьева','Анжела','4329 424113','7637387158134389','Коммерческий директор'),(71,'Ретюнских','Герман','4674 769617','6861790783087482','Таксист'),(72,'Ярошевский','Егор','4163 131031','9734001921956934','Коммерческий директор'),(73,'Калинина','Ульяна','4717 258749','7134392982214191','Моторист'),(74,'Скоробогатов','Савва','4935 976794','2292430534984088','Геолог'),(75,'Котельникова','Ева','4426 392326','6796410583096648','Web-программист'),(76,'Яницкая','Анфиса','4952 798471','5411234289247442','Финансист'),(77,'Судакова','Вероника','4040 409407','5146852101152524','Таксист'),(78,'Букин','Григорий','4090 289027','3610344565634200','Администратор базы данных'),(79,'Кошелева','Людмила','4655 604990','3646364578052057','Прокурор'),(80,'Машлыкина','Александра','4299 876662','6609391379756325','Дизайнер-конструктор'),(81,'Сунгатулин','Филипп','4148 385721','5826097944541487','Литейщик'),(82,'Баженов','Захар','4852 384554','9596874957816420','Проводник'),(83,'Ямов','Алексей','4986 372332','7042903729954523','Кондуктор'),(84,'Янишпольский','Филипп','4362 828754','9099854202740899','Физик'),(85,'Карюгин','Давид','4386 733080','6454318789538430','Кредитный консультант'),(86,'Амбражевича','Марина','4867 141643','6294884633858639','Гляциолог'),(87,'Ясенков','Виктор','4665 147668','6095069599497322','Полицейский'),(88,'Малюгин','Лев','4061 884050','1627798458033286','Педиатр'),(89,'Гагарин','Афанасий','4871 109439','2756690415140109','Министр'),(90,'Явчуновский','Евгений','4038 610034','4438969199828480','Миколог'),(91,'Палагута','Аполлинария','4583 654369','7679856483881043','Нотариус'),(92,'Квасникова','Дарья','4032 759748','2421649352630069','Юрист'),(93,'Дружинин','Константин','4523 184879','7625430053081512','Программист'),(94,'Кулдошина','Римма','4197 764013','5952766842744226','Педагог'),(95,'Сапогов','Федор','4563 582668','3434870936699519','Коммерческий директор'),(96,'Чиркова','Пелагея','4189 384841','6086524698870869','Бизнес-аналитик'),(97,'Молодых','Семен','4821 405959','7024740385225063','Формовщик'),(98,'Нуряева','Алина','4133 664220','9600404667896325','Сборщик'),(99,'Тучков','Федор','4192 936729','1851884392718577','Программист'),(100,'Шурыгин','Давид','4829 285296','5359799289393772','Египтолог');
/*!40000 ALTER TABLE `clients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `services`
--

DROP TABLE IF EXISTS `services`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `services` (
  `serviceID` int NOT NULL AUTO_INCREMENT,
  `clientID` int NOT NULL,
  `serviceTime` datetime NOT NULL,
  `diagnose` varchar(50) NOT NULL,
  `serviceName` varchar(50) NOT NULL,
  `servicePlace` varchar(30) NOT NULL,
  `servicePayment` enum('бюджет','платно') NOT NULL,
  PRIMARY KEY (`serviceID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `services`
--

LOCK TABLES `services` WRITE;
/*!40000 ALTER TABLE `services` DISABLE KEYS */;
/*!40000 ALTER TABLE `services` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `login` varchar(30) NOT NULL,
  `pass` char(32) NOT NULL,
  PRIMARY KEY (`login`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES ('codobor','0fdc7b4fe34a73d5e405302d73ea1493'),('test','11111111111111111111111111111111');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-02-16  2:16:04
